[
    {
        "id": "60090c9ad88f265811db77cb",
        "name": "Huawei Enjoy 20 SE",
        "description": "Huawei Enjoy 20 SE is officially announced on December 23, 2020. The smartphone is powered by the Kirin 710A Octa-core processor. The smartphone comes with a 6.67 inches IPS LCD capacitive touchscreen and 1080 x 2400 pixels resolution. The rear camera consists of a triple camera: 13 MP (wide) + 8 MP (ultrawide) 2 MP (macro) sensor lenses. The front camera has an 8 MP (wide) sensor. The device is enabled with sensors such as Fingerprint (side-mounted), accelerometer, proximity, and compass. The smartphone is fueled by a Non-removable Li-Po 5000 mAh battery + Fast charging 22.5W, 46% in 30 min (advertised). The phone runs on Android 10 + EMUI 10.1, no Google Play Services. The Huawei Enjoy 20 SE comes in different colors such as Crush Green, Blush Gold, and Midnight Black. It features USB Type-C 2.0, USB On-The-Go, GPS with A-GPS, GLONASS, GALILEO, BDS, and Bluetooth 5.1.",
        "url": "https://www.gizmochina.com/wp-content/uploads/2020/12/1-8-500x500.jpg",
        "quantity": 580,
        "price": 195,
        "createdAt": 1611205786006,
        "updatedAt": 1611205786006
    },
    {
        "id": "60090c5dd88f265811db77ca",
        "name": "Vivo V20 2021",
        "description": "Vivo V20 2021 is officially released on December 24, 2020. The smartphone comes in a dimension of 161.3 x 74.2 x 7.4 mm and weighs 171 grams. It supports Dual SIM (Nano-SIM, dual stand-by) and the resolution of the display is 1080 x 2400 pixels. It is packed with 8 GB RAM with 128 GB internal storage. The smartphone is powered by Qualcomm SDM730 Snapdragon 730 Octa-core processor. Vivo V20 2021 runs on the Android 11 + Funtouch 11 operating system. It is fueled with a non-removable Li-Po 4000 mAh battery + Fast charging 33W. The smartphone is available in various colors such as Sunset Melody, Midnight Jazz, and Moonlight Sonata.",
        "url": "https://www.gizmochina.com/wp-content/uploads/2020/12/1-9-500x500.jpg",
        "quantity": 280,
        "price": 339,
        "createdAt": 1611205725054,
        "updatedAt": 1611205725054
    },
    {
        "id": "60090c05d88f265811db77c9",
        "name": "Oppo Reno5 4G",
        "description": "Oppo Reno5 4G is not officially announced yet while the below-mentioned specs are based on rumors. The smartphone is integrated with a big screen of 6.43 inches OLED capacitive touchscreen while the screen density is 409 PPI. The smartphone supports Dual SIM (Nano-SIM, dual stand-by) and it runs on the Android 11 + ColorOS 11.1 operating system. The resolution of the screen is 1080 x 2400 pixels and it is fueled with a non-removable Li-Po 4310 mAh battery + Fast charging 50W + Reverse charging + SuperVOOC 2.0. The device is built with a glass front, glass back, and aluminum frame. The smartphone features a quad camera on the rear side 64 MP (wide) + 8 MP (ultrawide) + 2 MP (macro) + 2 MP (depth). On the front, there is a single camera 44 MP. The phone is pack with 8 GB RAM and 128 GB internal storage. The Oppo Reno5 4G includes sensors such as Fingerprint (under display, optical), accelerometer, gyro, proximity, and compass.",
        "url": "https://www.gizmochina.com/wp-content/uploads/2020/11/OPPO-Reno-5-1-500x500.jpg",
        "quantity": 380,
        "price": 600,
        "createdAt": 1611205637192,
        "updatedAt": 1611205637192
    },
    {
        "id": "60090bded88f265811db77c8",
        "name": "Vivo Y20 2021",
        "description": "Vivo Y20 2021 is officially announced on December 30, 2020. The smartphone comes in a dimension of 164.4 x 76.3 x 8.4 mm and weighs 192 grams. The device supports Dual SIM (Nano-SIM, dual stand-by) and the display size is 6.51 inches IPS LCD. The resolution of the display is 720 x 1600 pixels and it is packed with 4 GB RAM with 64 GB internal storage. The smartphone is powered by a Mediatek MT6765 Helio P35 Octa-core processor. Vivo Y20 2021 runs on the Android 10 + Funtouch 11 operating system. It is fueled with a non-removable Li-Po 5000 mAh battery + Fast charging 10W. The smartphone is available in colors such as Dawn White and Nebula Blue. It is integrated with sensors such as Fingerprint (side-mounted), accelerometer, gyro, proximity, and compass. The smartphone consists of triple camera: 13 MP (wide) + 2 MP (macro) + 2 MP (depth). On the front, there is a single camera consists of 8 MP (wide).",
        "url": "https://www.gizmochina.com/wp-content/uploads/2021/01/1-2-500x500.jpg",
        "quantity": 280,
        "price": 147,
        "createdAt": 1611205598758,
        "updatedAt": 1611205598758
    },
    {
        "id": "60090bb0d88f265811db77c7",
        "name": "Vivo Y20A",
        "description": "Vivo Y20A is officially released on January 02, 2020. The smartphone is powered by a Qualcomm SDM439 Snapdragon 439 Octa-core processor. The smartphone comes in a dimension of 164.4 x 76.3 x 8.4 mm and weighs 192 grams. The device supports Dual SIM (Nano-SIM, dual stand-by). The display size of the device is 6.51 inches IPS LCD. The resolution of the display is 720 x 1600 pixels and it is packed with 3 GB RAM with 64 GB internal storage. Vivo Y20A runs on the Android 10 + Funtouch 11 operating system. It is fueled with a non-removable Li-Po 5000 mAh battery + Charging 10W. The smartphone is available in colors such as Dawn White and Nebula Blue. It is integrated with sensors such as Fingerprint (side-mounted), accelerometer, gyro, proximity, and compass.",
        "url": "https://www.gizmochina.com/wp-content/uploads/2021/01/1-2-500x500.jpg",
        "quantity": 80,
        "price": 159,
        "createdAt": 1611205552505,
        "updatedAt": 1611205552505
    },
    {
        "id": "60090b87d88f265811db77c6",
        "name": "Xiaomi Redmi Note 9T 5G",
        "description": "Xiaomi Redmi Note 9T 5G is officially released on January 18, 2021. The smartphone has a dimension of 161.2 x 77.3 x 9.1 mm and it weighs 199 grams. It is powered by the MediaTek Dimensity 800U 5G Octa-core processor while the GPU is Mali-G57 MC3. The device comes in 6.53 inches size and the display is IPS LCD capacitive touchscreen. The display resolution is 1080 x 2340 pixels and the PPI density is 395. The device is equipped with sensors such as Fingerprint (side-mounted), accelerometer, gyro, proximity, and compass. The rear camera consists of triple camera: 48 MP (wide) + 2 MP (macro) + 2 MP (depth) sensor lenses. The front camera has a 13 MP (standard) sensor. The smartphone is fueled by a Non-removable Li-Po 5000 mAh battery and a fast-charging 18W.",
        "url": "https://www.gizmochina.com/wp-content/uploads/2021/01/11-500x500.jpg ",
        "quantity": 199,
        "price": 229,
        "createdAt": 1611205511164,
        "updatedAt": 1611205511164
    },
    {
        "id": "60090b5ed88f265811db77c5",
        "name": "Xiaomi Mi 10i 5G",
        "description": "Xiaomi Mi 10i is officially announced on January 05, 2020. The dimension of the smartphone is 165.4 x 76.8 x 9 mm and it weighs 214.5 grams. The smartphone is built with a Glass front (Gorilla Glass 5), glass back (Gorilla Glass 5) while it supports Hybrid Dual SIM (Nano-SIM, dual stand-by). The display of the smartphone has IPS LCD with 6.67 inches size. The resolution of the screen is 1080 x 2400 pixels and it is covered by Corning Gorilla Glass 5. The display is protected by Corning Gorilla Glass 5. The smartphone is powered by Qualcomm SM7225 Snapdragon 750G 5G Octa-core processor while the GPU is Adreno 619. The rear camera consists of 108 MP (wide) + 8 MP (ultrawide) + 2 MP (macro) + 2 MP (depth). On the front, there is a single camera sensor: 16 MP. The smartphone is pack with 6 GB and 8 GB RAM with 128 GB internal storage. The sensors include Fingerprint (side-mounted), accelerometer, gyro, proximity, and compass.",
        "url": "https://www.gizmochina.com/wp-content/uploads/2021/01/Xiaomi-Mi-10i-5G-500x500.jpg",
        "quantity": 299,
        "price": 300,
        "createdAt": 1611205470604,
        "updatedAt": 1611205470604
    },
    {
        "id": "60090b32d88f265811db77c4",
        "name": "Xiaomi Redmi Note 10 Pro 4G",
        "description": "Xiaomi Redmi Note 10 Pro 4G is not officially announced yet. The below-mentioned specs are based on rumors. It is powered by the Qualcomm SM7150 Snapdragon 732G Octa-core processor while the GPU is Adreno 618. The device comes in 6.67 inches size and the display is IPS LCD capacitive touchscreen. The display resolution is 1080 x 2400 pixels and the PPI density is 395. The device is equipped with sensors such as Fingerprint (side-mounted), accelerometer, gyro, proximity, and compass. The rear camera consists of quad-camera: 64 MP (wide) + 8 MP (ultrawide) + 2 MP (depth) + 2 MP (macro) sensor lenses. The front camera has a 16 MP (wide) sensor. The smartphone is fueled by a Non-removable Li-Po 5050 mAh + Fast charging 33W + Reverse charging. ",
        "url": "https://www.gizmochina.com/wp-content/uploads/2021/01/Xiaomi-Redmi-Note-10-Pro-4G-500x500.jpg",
        "quantity": 39,
        "price": 500,
        "createdAt": 1611205426478,
        "updatedAt": 1611205426478
    },
    {
        "id": "60090b04d88f265811db77c3",
        "name": "Realme V15 5G",
        "description": "Realme V15 5G is officially announced on January 07, 2021. The smartphone is powered by MediaTek MT6873 Dimensity 800U 5G Octa-core processor. The internal storage consists of 128 GB while the RAM options are 6 GB and 8 GB. The smartphone comes with a big display of 6.4 inches with a Super AMOLED capacitive touchscreen. The resolution of the display is 1080 x 2400 pixels and the screen PPI is 411. The operating system of the device is Android 10 + Realme UI. The device consists of a triple-camera 64 MP (wide) + 8 MP (ultrawide) + 2 MP (macro).",
        "url": "https://www.gizmochina.com/wp-content/uploads/2021/01/1-3-500x500.jpg",
        "quantity": 220,
        "price": 232,
        "createdAt": 1611205380102,
        "updatedAt": 1611205380102
    },
    {
        "id": "60090ac8d88f265811db77c2",
        "name": "Xiaomi Mi 11 Lite",
        "description": "Xiaomi Mi 11 Lite is not officially announced yet. The below-mentioned specs are based on rumors. The smartphone is powered by the Qualcomm SM7150 Snapdragon 732G Octa-core processor. The smartphone comes with a 6.67 inches and 1080 x 2400 pixels resolution. The rear camera consists of triple-camera: 64 MP (wide) + 8 MP (ultrawide) + 5 MP (macro) while on the front there is a 16 MP (wide). The sensors integrated on the device are Fingerprint (side-mounted), accelerometer, gyro, proximity, and compass. The smartphone is fueled by a Non-removable Li-Po 5000 mAh battery + Fast charging. The phone runs on the Android 11 + MIUI 12 operating system. Xiaomi Mi 11 Lite comes in two colors: Black and Blue. It features a USB Type-C 2.0, USB On-The-Go, GPS with dual-band A-GPS, GLONASS, BDS, GALILEO.",
        "url": "https://www.gizmochina.com/wp-content/uploads/2020/04/Xiaomi-Mi-Note-10-Lite-500x500.jpg",
        "quantity": 320,
        "price": 190,
        "createdAt": 1611205320127,
        "updatedAt": 1611205320127
    },
    {
        "id": "60090a95d88f265811db77c1",
        "name": "Samsung Galaxy M02s",
        "description": "Samsung Galaxy M02s is officially announced on January 07, 2021. The smartphone is pack with 3 GB and 4 GB RAM with 32 GB and 64 GB internal storage. The memory can be increased with the help of microSDXC (dedicated slot). It is fueled with a non-removable Li-Po 5000 mAh battery + Fast battery charging 15W. Samsung Galaxy M02s features a 6.5 inches PLS IPS display that has a 720 x 1600 pixels resolution. The device comes in Black, Blue, and Red. The smartphone is integrated with a Single SIM (Nano-SIM) or Dual SIM (Nano-SIM, dual stand-by).",
        "url": "https://www.gizmochina.com/wp-content/uploads/2021/01/1-4-500x500.jpg",
        "quantity": 220,
        "price": 122,
        "createdAt": 1611205269728,
        "updatedAt": 1611205269728
    },
    {
        "id": "60090a66d88f265811db77c0",
        "name": "Lava Z6",
        "description": "Lava Z6 is officially announced on January 07, 2021. The smartphone comes in a size of 6.51 inches with IPS LCD capacitive touchscreen. The display provides a resolution of 720 x 1600  pixels and 270 PPI density. The screen is protected by Corning Gorilla Glass 3. The Lava Z6 is powered by a MediaTek Helio G35 Octa-core processor and PowerVR GE8320 GPU. The smartphone is pack with 6 GB of RAM and 64 GB of internal storage that can be extended through microSDXC (dedicated slot). The smartphone is pack with a triple camera: 13 MP (wide) + 5 MP (ultrawide) + 2 MP (depth) on the back and a 16 MP (wide) front for clicking selfies. The smartphone is fueled with a 5000 mAh Li-Ion capacity which is non-removable.",
        "url": " https://www.gizmochina.com/wp-content/uploads/2021/01/Lava-Z6-2-500x500.jpg",
        "quantity": 200,
        "price": 134,
        "createdAt": 1611205222785,
        "updatedAt": 1611205222785
    },
    {
        "id": "600908dcd88f265811db77bf",
        "name": "Xiaomi Redmi 9T",
        "description": "xiaomi Redmi 9T is officially announced on January 08, 2021. The smartphone has a dimension of 162.3 x 77.3 x 9.6 mm and it weighs 198 grams. It is powered by the Qualcomm SM6115 Snapdragon 662 Octa-core processor while the GPU is Adreno 610. The device comes in 6.53 inches size and the display is IPS LCD capacitive touchscreen. The display resolution is 1080 x 2340 pixels and the PPI density is 395. The screen is protected by Corning Gorilla Glass 3. The device is equipped with sensors such as Fingerprint (side-mounted), accelerometer, proximity, and compass. The rear camera consists of quad-camera: 48 MP (wide) + 8 MP (ultrawide) + 2 MP (macro) + 2 MP (depth) sensor lenses.",
        "url": "https://www.gizmochina.com/wp-content/uploads/2021/01/1-5-500x500.jpg ",
        "quantity": 400,
        "price": 196,
        "createdAt": 1611204828390,
        "updatedAt": 1611204828390
    },
    {
        "id": "60090873d88f265811db77be",
        "name": "Vivo iQOO 7",
        "description": "Vivo iQOO 7 is officially announced on January 11, 2021. The smartphone is powered by Qualcomm SM8350 Snapdragon 888 Octa-core processor and Adreno 660 GPU. The smartphone has a huge 4000 mAh battery capacity that is enabled with Fast charging 120W, 100% in 15 min (advertised). The device is incorporated with Face Wake facial recognition sensor along with Fingerprint (under display, optical), accelerometer, gyro, proximity, compass, and color spectrum. It supports Bluetooth 5.2, GPS with dual-band A-GPS, GLONASS, BDS, GALILEO, and USB Type-C, USB On-The-Go.",
        "url": "https://www.gizmochina.com/wp-content/uploads/2021/01/Vivo-iQOO-7-500x500.jpg",
        "quantity": 320,
        "price": 583,
        "createdAt": 1611204723855,
        "updatedAt": 1611204723855
    },
    {
        "id": "6009080ad88f265811db77bd",
        "name": "Motorola One 5G Ace",
        "description": "Motorola One 5G Ace is officially released on January 14, 2021. The smartphone is powered by the Qualcomm SM7225 Snapdragon 750G 5G Octa-core processor. The smartphone comes with a 6.7 inches LTPS IPS LCD and 1080 x 2400 pixels resolution. The dimension of the smartphone is 166.1 x 76.1 x 9.9 mm and it weighs 212 grams. While the device supports Nano-SIM, it comes with a water-repellent coating. The rear camera consists of a triple-camera 48 MP (wide) + 8 MP (ultrawide) + 2 MP (macro) lenses while on the front, there is 16 MP (wide).",
        "url": "https://www.gizmochina.com/wp-content/uploads/2021/01/3-1-500x500.jpg",
        "quantity": 150,
        "price": 400,
        "createdAt": 1611204618438,
        "updatedAt": 1611204618438
    },
    {
        "id": "600907b0d88f265811db77bc",
        "name": "Motorola Moto G Power (2021)",
        "description": "Motorola Moto G Power (2021) is officially released on January 14, 2021. The smartphone is powered by Qualcomm SM6115 Snapdragon 662 and it runs on the Android 10 operating system. The smartphone comes with a triple-camera that consists of 48 MP (wide) + 2 MP (macro) + 2 MP (depth) while on the front there is an 8 MP. The size of the screen is 6.6 inches and the screen type is an IPS LCD capacitive touchscreen that will give you an output of 720 x 1600 pixels. The sensors include Fingerprint (side-mounted), accelerometer, gyro, proximity, compass, and barometer.",
        "url": "https://www.gizmochina.com/wp-content/uploads/2021/01/1-11-500x500.jpg",
        "quantity": 200,
        "price": 206,
        "createdAt": 1611204528555,
        "updatedAt": 1611204528555
    },
    {
        "id": "6009076ed88f265811db77bb",
        "name": "Oppo A53 5G",
        "description": "The dimension of the smartphone is 162.2 x 75 x 7.9 mm and it weighs 175 grams. The screen size is 6.5 inches display with IPS LCD capacitive touchscreen technology that provides 1080 x 2400 pixels resolution and 405 PPI density. The smartphone runs on the Android 10.0 operating system with ColorOS 7.2. It is available in three colors: Black, Green, and Purple. The MediaTek MT6853V Dimensity 720 5G Octa-core processor while the GPU is Mali-G57 MC3. It features Bluetooth 5.1, GPS with A-GPS, GLONASS, GALILEO, BDS, and USB Type-C 2.0, USB On-The-Go. The device is pack with 4 GB and 6 GB RAM with 128 GB internal storage.",
        "url": "https://www.gizmochina.com/wp-content/uploads/2020/12/Oppo-A53-5G-2-500x500.jpg",
        "quantity": 28,
        "price": 196,
        "createdAt": 1611204462811,
        "updatedAt": 1611204462811
    },
    {
        "id": "600906a7d88f265811db77ba",
        "name": "TCL 20 SE",
        "description": "TCL 20 SE is officially announced on January 11, 2021.The smartphone comes with a 6.82 inches screen size with IPS LCD capacitive touchscreen with 450 nits (typ). The density of the screen is 263 PPI and the resolution is 720 x 1640 pixels.The device runs on the Android 11 + TCL UI operating system. The smartphone is fueled by a Non-removable Li-Po 5000 mAh battery + Fast charging 18W. The sensors include Fingerprint (rear-mounted), accelerometer, gyro, proximity, and compass.The smartphone is powered by the Qualcomm SM4250 Snapdragon 460 Octa-core processor. The device is pack with 4 GB RAM with 64 GB and 128 GB internal storage that can be increased with microSDXC (uses shared SIM slot).",
        "url": "https://www.gizmochina.com/wp-content/uploads/2021/01/1-13-500x500.jpg",
        "quantity": 308,
        "price": 180,
        "createdAt": 1611204263016,
        "updatedAt": 1611204263016
    },
    {
        "id": "600905c5d88f265811db77b9",
        "name": "Samsung Galaxy S21 Ultra 5G",
        "description": "Samsung Galaxy S21 Ultra 5G is fueled with a non-removable Li-Po 5000 mAh battery + Fast charging 45W + USB Power Delivery 3.0 + Fast Qi/PMA wireless charging 15W + Reverse wireless charging 4.5W. The smartphone features a 6.8 inches Dynamic AMOLED 2X display that has a 1440 x 3200 pixels resolution.",
        "url": "https://fdn2.gsmarena.com/vv/bigpic/samsung-galaxy-s21-ultra-5g-.jpg",
        "quantity": 30,
        "price": 1380,
        "createdAt": 1611204037848,
        "updatedAt": 1611204037848
    }
]
